Revit 2027 API
PrintParameters.HiddenLineViews Property
 The hidden line views type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HiddenLineViewsType HiddenLineViews { get; set; }
Public Property HiddenLineViews As HiddenLineViewsType
	Get
	Set
public:
property HiddenLineViewsType HiddenLineViews {
	HiddenLineViewsType get ();
	void set (HiddenLineViewsType value);
}
member HiddenLineViews : HiddenLineViewsType with get, set
Property Value
HiddenLineViewsType
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace